Repository: vdhamer/Photo-Club-Hub
Catalog: Localization/Photo Club Hub Localizations/*.xcloc/Localized Contents/*.xliff
Languages: nl

source: %lld members (inc. ex-members)
nl: %lld leden (incl. ex-leden)

source: %lld organizations
nl: %lld organisaties

source: %lld organizations (of %lld)
nl: %lld organisaties (van de %lld)

source: %lld photographers
nl: %lld fotografen

source: %lld photographers (of %lld)
nl: %lld fotografen (van de %lld)

source: 1 organization
nl: 1 organisatie

source: 1 organization (of %lld)
nl: 1 organisatie (van de %lld)

source: 1 photographer
nl: 1 fotograaf

source: 1 photographer (of %lld)
nl: 1 fotograaf (van de %lld)

source: Advanced
nl: Technische instellingen

source: Amsterdam has two photography museums.
nl: Fotomusea aan de Keizersgracht in Amsterdam.

source: App version %@ (build %@)
nl: App versie %@ (build %@)

source: Birthday
nl: Verjaardag

source: Birthday unknown
nl: Verjaardag onbekend

source: Buttons for the automatic slide show
nl: Knopjes om de beelden automatisch te doorlopen

source: Clubs and Museums
nl: Clubs en Musea

# Clubs, their Members, and their Portfolios&#10;
source: Clubs, their Members, and their Portfolios
nl: Clubs, hun Leden en hun Portfolio's

source: Configuring Level 1 data for a Dutch photo club
nl: Sjabloon voor het toevoegen van een fotoclub

source: Data source: %@://%@%@/
nl: Bron: %@://%@%@/

source: Data source: in-app member data.
nl: Bron: in-app ledenlijst.

source: Example of a link to a club web site
nl: Link (in blauw) naar een club website

source: Fragment of the Swift source code
nl: Swift codefragment t.a.v. functies in het clubbestuur

source: In debug mode
nl: Test versie

source: Manual loading
nl: Handmatig laden

source: Maps can be viewed in 3D
nl: Omgeving van een fotomuseum in 3D

source: Member categories
nl: Lidmaatschapstypen

source: No known personal website
nl: Geen fotografie website bekend

source: No photo clubs seem to be currently loaded. Try dragging down the Clubs and Museums screen to reload the default clubs.
nl: Er zijn geen Fotogroepen momenteel geladen. Door dit Fotogroepen scherm omlaag te slepen en los te laten worden enkele voorbeeldclubs geladen.

source: Options in Settings
nl: Opties bij Instellingen

source: Part of the internal translation table
nl: Een stukje van de interne EN-NL vertaaltabel

source: Photo Club Hub
nl: Fotoclub Hub

# PhotoClubs_Caption_1
source: ① This list consists of two sublists. The first shows the photo clubs, the second shows photo museums.
nl: ① De lijst begint met alle ondersteunde fotoclubs, gevolgd door alle fotomusea.

# PhotoClubs_Caption_2
source: ② To find a particular club or museum, enter part of its name or town in the Search bar at the top.
nl: ② Er is een Zoekveld bovenaan het scherm. Hiermee kunnen clubs en musea gevonden worden door hun naam of locatie in te voeren.

# PhotoClubs_Caption_3
source: ③ You can unlock/lock a map's scrolling and panning features using the Lock icon.
nl: ③ Het slotje kan gebruikt worden om deze landkaarten sleepbaar en inzoombaar/uitzoombaar te maken.

source: Preferences
nl: Instellingen

source: Search bar at the top of Portfolios screen
nl: Zoekfunctie bovenaan het Portfolio’s scherm

source: Search names and towns
nl: Zoek op naam of gemeente

# Search_names_m
source: Search names
nl: Zoek op naam

# Search_names_p
source: Search names
nl: Zoek op naam

source: Show aspiring members
nl: Toon aspirant-leden

source: Show club officers
nl: Toon bestuursleden

source: Show current members
nl: Toon huidige leden

source: Show deceased members
nl: Toon overleden leden

source: Show external coaches
nl: Toon externe mentoren

source: Show former members
nl: Toon ex-leden

source: Show honorary members
nl: Toon ereleden

source: The Preferences screen.
nl: Het Instellingen scherm in de app zelf.

source: To see names here, please adapt the Search filter or enable additional categories on the Preferences page.
nl: Deze lijst is leeg doordat de Zoek filter niets vindt in de gekozen ledencategorieën. Pas dus de Zoek filter aan of voeg categorieën toe (bij Instellingen).

source: To see names here, please enable additional categories on the Preferences page.
nl: Deze lijst is vermoedelijk leeg omdat er onvoldoende ledencategorieën geselecteerd zijn op het Instellingen scherm.

source: Warning: all member categories on the Preferences page are disabled. Please enable one or more options in Preferences.
nl: Waarschuwing: op de Instellingen pagina staan alle soorten leden op “niet weergeven“. Hierdoor is deze lijst leeg.

source: Who's Who
nl: Namenlijst

# WhosWho_Caption_1
source: ① This page lists all the photographers known to the app.
nl: ① Deze lijst bevat alle fotografen die in deze app voorkomen.

# WhosWho_Caption_2
source: ② A photographer has one or more clickable image thumbnails below the photographer's name. Clicking on a thumbnail brings you to the image portfolio for that potographer/club combination.
nl: ② Per fotograaf zijn er meestal één of twee miniatuurfoto's. Klik op een foto om een portfolio te bekijken.

# WhosWho_Caption_3
source: ③ The thumbnails can be scrolled horizontally.
nl: ③ De miniatuurfoto's kunnen horizontaal versleept worden, al zal dat zelden nodig zijn.

source: chairman
nl: voorzitter

source: member
nl: lid

source: members
nl: leden

# of1
source: of
nl: van

# other
source: Club officer
nl: bestuurslid

source: secretary
nl: secretaris

source: shown
nl: getoond

source: treasurer
nl: penningmeester

source: vice-chairman
nl: vicevoorzitter

source: “Current members” includes “club officers”
nl: De optie “huidige leden“ bevat “bestuursleden“

source: “Former members” includes “deceased members”
nl: De optie “ex-leden“ bevat “overleden leden“

# No remark currently available for %@ %@.
source: No remark currently available for %1$@ %2$@.
nl: Geen bijzonderheden bekend over %@ %@.

source: and
nl: en

source: deceased
nl: overleden

source: external coach
nl: mentor

source: former
nl: voormalig

source: honorary member
nl: erelid

source: member
nl: lid

source: museums
nl: musea

# of2
source: of
nl: van

source: prospective member
nl: aspirant-lid

source: unknowns
nl: onbekenden

# CFBundleDisplayName
source: Photo Club Hub
nl: Fotoclub Hub

# CFBundleName
source: Photo Club Hub
nl: Fotoclub Hub

# NSLocationWhenInUseUsageDescription
source: To display your current location on the maps.
nl: Om de huidige locatie van de gebruiker te tonen op de landkaarten.

source: Features and Tips
nl: Functionaliteit en Tips

source: How you can help
nl: App zoekt hulp

source: Readme
nl: Over deze app

source: Supported Platforms
nl: iOS en iPadOS

source: The App
nl: Overzicht

source: The Concept
nl: Het Concept

# §1.1
source: _Photo Club Hub_ displays selected photos made by members of photo clubs in a consistent, accessible manner, while minimizing distractions.
nl: De _Fotoclub Hub_ app presenteert geselecteerd werk van leden van fotoclubs. De foto's zijn op een consistente wijze te bekijken. Men kan de app dus zien als een permanente online tentoonstelling.

# §1.2
source: This consistency eliminates the need to manually find each club’s website and discover how to navigate its photo galleries. The app doesn’t replace club-, photographer-, or social media sites. Instead, it supports clubs and their members who try to reach out to other clubs, to other photographers, and to a general audience.
nl: Door de foto's op een consistente manier te presenteren, hoeft de gebruiker de website van de club niet op te zoeken om vervolgens uit te zoeken hoe de foto's te bekijken zijn.

# §1.3
source: The app aims to strengthen ties between photography clubs and make their members’ photos easily accessible.
nl: De app probeert nadrukkelijk __niet__ om de websites of b.v. Facebook sites van clubs te vervangen: de _Fotoclub Hub_ app dient alleen om banden tussen fotoclubs te versterken en om foto's gemaakt door de clubleden eenvoudig toegankelijk te maken.

# §1.4
source: The app, originally named _Photo Club Waalre_, was created for a 15-person photo club in the southern Netherlands. The newer name, _Photo Club Hub_, emphasizes the app’s mission to foster connections among various photo clubs.
nl: Oorspronkelijk heette deze app _Fotogroep Waalre_, naar een fotoclub bij Eindhoven. Het woord __hub__ (= middelpunt, trefpunt) in de nieuwe naam benadrukt dat de huidige versie __meerdere__ fotoclubs ondersteunt en verbindt.

# §1.5
source: Supporting dozens or even hundreds of clubs necessitates that each club manages its own data, including providing images and maintaining lists of club members. Notably, no software expertise is required to add a club to _Photo Club Hub_.
nl: Het ondersteunen van tientallen of zelfs honderden clubs vereist dat de clubs _zelf_ hun gegevens beheren. Het gaat hier om het bijhouden van ledenlijsten en lijsten met portfolio foto’s. Hiervoor is geen specifieke softwarekennis nodig.

# §1.6
source: Interested in supporting your club? Contact us via [GitHub](https://github.com/vdhamer/Photo-Club-Hub), [Facebook](https://www.facebook.com/vdhamer), or [LinkedIn](https://www.linkedin.com/in/vdhamer/). Providing and maintaining club data in a standardized way is all that’s required. The app’s [GitHub site](https://github.com/vdhamer/Photo-Club-Hub) explains this approach in detail. We’re here to help with any questions.
nl: Heb je belangstelling om jouw club in de app te krijgen? Neem dan contact op via [GitHub](https://github.com/vdhamer/Photo-Club-Hub), [Facebook](https://www.facebook.com/vdhamer), [Mastodon](https://mastodon.social/@vdhamer) of [LinkedIn](https://www.linkedin.com/in/vdhamer/). Dit vereist alleen dat er informatie in een gestandaardiseerd formaat aangeleverd wordt. Neem bij hulpvragen gerust contact op.

# §2.1
source: Photo clubs play a key role in the app. The central _Portfolios_ screen shows a list of photo clubs.
nl: Fotoclubs en hun leden spelen een dominante rol in deze app. Het centrale Portfolio's scherm bevat een lijst met __fotoclubs__.

# §2.2
source: Each photo club contains a series of member __portfolios__ that hold the actual images. Each portfolio covers the photographer's photos that are associated with that photo club.
nl: Een club heeft op zijn beurt een lijst met __portfolio's__ van hun leden. Iedere portfolio bevat links naar de te tonen foto's.

# §2.3
source: A photographer may have multiple portfolios in the app if case the photographer is (or was) associated with more than one photo club.
nl: Een lijst met geselecteerde __foto’s__ (“portfolio”) vertegenwoordigt het werk van één fotograaf voor zover dat hoort bij één club. Een fotograaf kan soms _meerdere_ portfolio's in de app hebben als de fotograaf lid is (of was) van meer dan één fotoclub.

# §2.4
source: Just like a painter, a photographer’s style often changes over the years. Each portfolio should preferably show the images in chronological order, with the latest work first.
nl: Net als bij een schilder, kan een fotograaf gedurende de tijd van onderwerp of stijl veranderen. Daarom is ieder portfolio bij voorkeur gesorteerd op tijdsvolgorde, met het recentste werk vooraan.

# §2.5
source: We try to show the portfolios with minimal distraction, just like an exposition at a museum or gallery. Web sites tend to be less suitable for this, because they are cluttered by browser controls (e.g., an address bar or tabs), and generally contain various additional types of information (e.g., club news or schedules).
nl: Net als bij een tentoonstelling is het belangrijk om een portfolio _zonder afleiding_ te kunnen bekijken. Webpagina's zijn hier vaak iets te druk voor vanwege allerlei bedieningselementen, maar ook omdat ze vaak meerdere soorten informatie bevatten (zoals aankondigingen, contactpersonen en de club agenda).

# §3.1.a
source: __Languages__
nl: __Tweetalig__

# §3.1.b
source: _Photo Club Hub_ automatically selects its language based on your device’s language settings. It currently supports English and Dutch. You can change language using _Settings > Photo Club Hub > Language_. Alternatively you can change your device’s preference across all apps using _Settings > General > Language & Region > Preferred Language Order_.
nl: De app ondersteunt zowel Nederlands (_Fotoclub Hub_) als Engels (_Photo Club Hub_). De app kiest de taal op basis van de taal die ingesteld is op het apparaat. Men kan de taalinstelling voor de app aanpassen onder _Instellingen → Fotoclub Hub → Voorkeurstaal_.

# §3.2.a
source: __3D maps__
nl: __3D kaarten__

# §3.2.b
source: If you zoom in far enough on any map, a button appears that allows you to view the area in three dimensions. In 3D mode you can rotate the map.
nl: Wanneer men voldoende inzoomt op een landkaart, verschijnt er een knop om de kaart in 3D weer te geven. Dit vereist dat de kaart interactief is (slotje is open). Probeer het bijvoorbeeld uit met New York met zijn wolkenkrabbers.

# §3.3.a
source: __Live location__
nl: __Locatieweergave__

# §3.3.b
source: Maps can display your current location as a purple dot when it falls within the map’s range. This can help you navigate to a club or to estimate distances. If the map is unlocked (interactive), an arrow button lets you re-center the map around your current location.
nl: De landkaarten kunnen de huidige locatie van de gebruiker als paarse stip weergeven indien deze binnen het bereik van de kaart valt. Indien het slotje open is, verschijnt er een pijlvormige knop waarmee de kaart gecentreerd kan worden rondom de huidige locatie.

# §3.3.c
source: Live location requires granting the app __permission__ to access your location while in the app. The app doesn’t store or share your location with anyone or anything.
nl: Locatieweergave vereist dat de gebruiker desgevraagd __toestemming__ verleent aan de app om locatiegegevens van iOS te ontvangen. Locatie informatie wordt niet door de app opgeslagen of doorgegeven: het dient alleen om te zien waar men op dat moment is.

# §3.4.a
source: __Adding photo clubs__
nl: __Toevoegen van clubs__

# §3.4.b
source: The app initially contains an initial list of over 60 photo clubs. Those clubs are currently all in one part of the Netherlands. The app is however designed to support clubs anywhere in the world and the list of clubs can be extended by the users.
nl: Momenteel kent de app ruim 60 fotoclubs in regio Brabant Oost. De meerderheid hiervan is aangesloten by de Koninklijke Fotobond. De app is in principe ook geschikt voor clubs in het buitenland.

# §3.4.c
source: For a club to be included, the app needs basic information like the club’s name and location (Level 1), a list of its members (Level 2) and links to image portfolios (Level 3). More details on extending the various lists are provided below and on GitHub.
nl: Om het werk van een club te ondersteunen, heeft de app informatie nodig over de naam en ligging van de club (“__Niveau 1__”), de ledenlijst (“__Niveau 2__”) en de portfolio’s met foto’s (“__Niveau 3__”). We komen later op deze 3 niveaus terug.

# §3.4.d
source: The initial list of 30+ photo museums can be similarly extended.
nl: Clubs, leden en foto’s toevoegen kan _zonder_ aanpassing van de app software. Dit gaat via online bestanden die de app ophaalt en weergeeft.

# §3.5.a
source: __Photo museums__
nl: __Fotomusea__

# §3.5.b
source: The maps can show various photo museums throughout the world. Museums and clubs are depicted differently on the map.
nl: De landkaarten tonen ook een aantal fotomusea in diverse landen (waaronder Nederland, Engeland, America, Japan en Australië). Om ze te zien moet de kaart van slot zijn zodat men voldoende kan uitzoomen.

# §3.5.c
source: Adding a photo museum works the same way as adding a photo club - except that a museum doesn’t have members or member portfolios.
nl: Het toevoegen van een fotomuseum werkt net als het toevoegen van een Niveau 1 fotoclub. Fotomusea hebben echter geen leden die foto’s aanleveren, en hebben dus ook geen Niveau 2 of 3 bestanden.

# §3.6.a
source: __Smart scrolling__
nl: __Slim Scrollen__

# §3.6.b
source: The _Clubs and Museums_ screen and the _Who’s Who_ screen feature _smart scrolling_, as introduced in iOS 17. This tries to prevent an item in a list from being partially visible. The _Portfolios_ screen does not currently support smart scrolling for technical reasons.
nl: Het _Clubs en Musea_ scherm and het _Namenlijst_ scherm ondersteunen zogenaamde "smart scrolling". Smart scrolling voorkomt dat tijdens het scrollen, een lijst tot stilstand komt op onhandige locaties zodat men bijvoorbeeld een halve foto of landkaart ziet.

# §3.7.b
source: This app is complimentary to your club’s web site. Because web sites serve more purposes than just presenting photos, _Photo Club Hub_ includes clickable links that lead to club- and photographer web sites.
nl: Omdat de websites van fotoclubs allerlei extra informatie bevatten, ondersteunt de app links om naar club websites te springen. De app ondersteunt ook links naar eventuele eigen fotografie websites van fotografen.

# §3.8.a
source: __The opening image__
nl: __Het openingsbeeld__

# §3.8.b
source: When the app opens, it shows an image (“Prelude”) corresponding to the app’s icon. If you tap somewhere __inside__ the image, it zooms out to show the full image representing how digital cameras see color.
nl: Na het opstarten van de app verschijnt er een beeld ("Prelude") dat afgeleid is van de app logo. Men kan in en uitzoomen door binnen het centrale beeld te klikken.

# §3.8.c
source: This involves a [Bayer color filter array](https://en.wikipedia.org/wiki/Bayer_filter) that adds a color filter on top of each sensor cell. This filter array is shown superimposed on a colorful photo.
nl: Uitgezoomd blijkt het beeld een foto te zijn voorzien van een maskerlaag met kleurenfilters. Dit geheel geeft aan hoe digitale camera's kleur kunnen zien (de chip zelf is namelijk volledig kleurenblind). Technisch heet dit een [Bayer kleurenfilter](https://nl.wikipedia.org/wiki/Bayerfilter). Per lichtgevoelige cel van de sensor worden bepaalde kleuren selectief doorgelaten. Een 24 MPixel full-frame camera heeft bijvoorbeeld een raster van circa 4000 x 6000 kleine kleurfiltertjes.

# §3.8.d
source: Tapping __inside__ the image allows you to zoom in or out to your heart's content. Tapping __outside__ the image area ends the animation. A single tap __outside__ the image allows you to skip the animation.
nl: Er is een knop rechtsonder waarmee men de __animatie afbreekt__. Het aanraken van iedere andere plek buiten de centrale vierkant werkt overigens ook.

# §3.8.e
source: The computations for this animation incidentally run on your device’s GPU cores. This is only scratching the surface of what these cores can do.
nl: De getoonde animatie wordt uitgerekend op de beschikbare [GPU](https://nl.wikipedia.org/wiki/Graphics_processing_unit) rekenkernen van het apparaat. De animatie is dus geen vooraf gemaakte video: de gebruiker kan de lopende animatie interactief beïnvloeden.

# §3.9.a
source: __Former Members__
nl: __Voormalige leden__

# §3.9.b
source: By default, former club members and their work are not shown, but this can be enabled on the _Preferences_ screen.
nl: De app kan ook voormalig clubleden tonen. Ex-leden zijn standaard niet zichtbaar, maar kunnen onder _Instellingen_ zichtbaar gemaakt worden.

# §3.9.c
source: An easy way to get recent ex-member data in the app is to simply not remove their portfolios when they leave. You should then change their status to ex-member in the membership ("Level 2") list.
nl: Een makkelijk manier om gegevens van recente ex-leden binnen de app te krijgen is om ze gewoon niet te wissen op het moment dat een lid vertrekt: in de ledenlijst (Niveau 2) kan aangegeven worden of iemand een ex-lid is.

# §3.10.a
source: __Automatic Slide Shows__
nl: __Automatische afspelen__

# §3.10.b
source: Some portfolios have an automatic slide show option. This is controlled by one of the buttons that appear when you tap on an image (this tapping is only needed on an iPhone).
nl: Portfolio's kunnen automatisch afgespeeld worden via een driehoekige afspeelknop. Soms moet je eerst de foto aanraken om de knop te zien.

# §3.10.c
source: This option is available on portfolios that were generated using the _Juicebox_ plug-in for _Lightroom Classic_ (see the portfolios of Fotogroep de Gender).
nl: Deze knop is deel van portfolio's die gegenereerd zijn vanuit de _Juicebox Pro_ plug-in voor _Lightroom Classic_. Zie bijvoorbeeld de portfolio's van leden van _Fotogroep de Gender_.

# §3.11.a
source: __Searching__
nl: __Zoekfunctie__

# §3.11.b
source: There is a search bar at the top of major screens. On an iPad the search bar is continuously visible. On an iPhone you need to scroll back to the very top of the list to get the search bar to appear.
nl: Bovenaan schermen met lijsten is er een invoerveld om binnen de lijst snel te kunnen zoeken. Op een iPhone wordt het zoekveld pas getoond als men helemaal naar de bovenkant van de lijst gaat.

# §3.11.c
source: Entering part of person’s name (on the _Portfolios_ and _Who’s Who_ screens) will find people with that name. The _Clubs and Museums_ screen simultaneously searches both on the club/museum name and on its specified location.
nl: Op de _Portfolio's_ en _Namenlijst_ schermen wordt er op de naam van fotografen gezocht. Op het _Clubs en Musea_ scherm wordt er gelijktijdig op clubnaam (of museumnaam) en de opgegeven locatie gezocht.

# §4.1
source: _Photo Club Hub_ generally requires the latest version of iOS. This allows us to keep the app technically up to date. The latest app version can thus run on devices released in the last 6 or 7 years.
nl: _Fotoclub Hub_ vereist een recente versie van iOS. In de praktijk betekent dit dat toestellen die niet ouder zijn dan een jaar of 6 de nieuwste app versies kunnen draaien.

# §4.2
source: The app is optimized for iOS and iPadOS. It can also run unoptimized on a Mac or Vision Pro.
nl: Om praktische redenen is de app geoptimaliseerd voor __iPhone__ en __iPad__. De app kan ook draaien op een Mac of Vision Pro.

# §4.3
source: Although there is presently no native support for __Android__ or other non-Apple phone platforms, we made a companion app that automatically generates website pages from the same online lists that the app uses. This helps keep club web sites up to date, and allows viewing of clubs, members, and images in a web browsers on a wide range of platforms (including Android, Windows, MacOS and Linux).
nl: Ofschoon er momenteel geen versie van deze app bestaat voor Android of andere niet-Apple telefoons, is er wel een [zuster app](https://github.com/vdhamer/Photo-Club-Hub-HTML) die web pagina’s aanmaakt aan de hand van dezelfde gegevens die de app gebruikt. Dit help om club websites bijgewerkt te houden, maar maakt het ook mogelijk om ledenlijsten en portfolio's in een web browser te bekijken op mobile apparaten (__Android__), PCs (__Windows__ en __MacOS__), of Linux.

# §4.4
source: These developments really depend on the help of volunteers from the clubs and the software community. If you’re interested in helping out, check out the section below.
nl: Omdat de code van de app en zijn bestandsformaten openbaar zijn (via [Github](https://github.com/vdhamer)) kunnen er in principe meer programma’s beschikbaar komen vanuit de software gemeenschap. De _Photo Club Hub HTML_ app voor websites is hier een voorbeeld van. Zo zou iemand software kunnen schrijven om de gestandaardiseerde gegevensinvoer te vergemakkelijken.
